file_name = 'coding.txt'
with open(file_name, mode='r', encoding='utf-8') as file:
    content = file.read()
    print(content)


# Отличия между использованием оператора with open(file_name...) и явным вызовом file.close():

# 1: Автоматическое закрытие файла:
# with open: Файл автоматически закрывается после завершения блока with, даже если произойдет ошибка.
# file.close(): Нужно самостоятельно вызвать file.close() для закрытия файла.
# Если забыть это сделать или произойдет ошибка, файл может остаться открытым.

# 2: Код становится чище и проще:
# with open: Код с with open выглядит аккуратнее и проще, так как не нужно беспокоиться о закрытии файла.
# file.close(): Нужно помнить о необходимости закрыть файл, что делает код немного сложнее.
